Охотники_и_рыболовы/src/Catalogs/Охотники/Охотники.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Охотники</name>
  <attributes>
    <name>Фамилия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Отчество</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРождения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЧленОООР</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Инвалид1Группы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВетеранВОВ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ШтатныйСотрудник</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Охотхозяйство</name>
    <type>
      <types>CatalogRef.Охотхозяйства</types>
    </type>
  </attributes>
  <attributes>
    <name>СерияГосБилета</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерГосБилета</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>7</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерТелефона</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЧленККОООР</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Исключен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

Охотники_и_рыболовы/src/InformationRegisters/ОхотничьиБилеты/ОхотничьиБилеты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОхотничьиБилеты</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Серия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Номер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаВыдачи</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЗарегистрированВ</name>
    <type>
      <types>CatalogRef.Охотхозяйства</types>
      <types>CatalogRef.ОрганыВыдачиГосБилетов</types>
    </type>
  </resources>
  <resources>
    <name>ДатаОкончанияДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>КемВыдан</name>
    <type>
      <types>CatalogRef.Охотхозяйства</types>
    </type>
  </resources>
  <resources>
    <name>ДатаНачалаЛишения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаОкончанияЛишения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Причина</name>
    <type>
      <types>EnumRef.ПричиныНедействительностиБилета</types>
    </type>
  </attributes>
  <dimensions>
    <name>Охотник</name>
    <type>
      <types>CatalogRef.Охотники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидБилета</name>
    <type>
      <types>EnumRef.ВидыОхотничьихБилетов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Действует</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Лишен</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Исключен</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Дата</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Охотники_и_рыболовы/src/Enums/ВидыОхотничьихБилетов/ВидыОхотничьихБилетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыОхотничьихБилетов</name>
  <enumValues>
    <name>ГосБилет</name>
    <comment>Охотничий билет Российской Федерации</comment>
  </enumValues>
  <enumValues>
    <name>ЧленскийБилет</name>
    <comment>Членский охотничье-рыболовный билет</comment>
  </enumValues>
</mdclass:Enum>

Охотники_и_рыболовы/src/Documents/РазрешениеНаОхоту/РазрешениеНаОхоту.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РазрешениеНаОхоту</name>
  <basedOn>Catalog.Охотники</basedOn>
  <registerRecords>AccumulationRegister.ДобытаяДичь</registerRecords>
  <registerRecords>AccumulationRegister.КвотыОхотхозяйства</registerRecords>
  <registerRecords>AccumulationRegister.ВыдачаРазрешений</registerRecords>
  <attributes>
    <name>СезонОхоты</name>
    <type>
      <types>CatalogRef.СезоныОхоты</types>
    </type>
  </attributes>
  <attributes>
    <name>Охотхозяйство</name>
    <type>
      <types>CatalogRef.Охотхозяйства</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоОхоты</name>
    <type>
      <types>CatalogRef.Охотхозяйства</types>
    </type>
  </attributes>
  <attributes>
    <name>Охотник</name>
    <type>
      <types>CatalogRef.Охотники</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>СерияРазрешения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерРазрешения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>7</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидДичи</name>
    <type>
      <types>CatalogRef.ВидыДичи</types>
    </type>
  </attributes>
  <attributes>
    <name>Сезонная</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Сдан</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Обработан</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроизвольныйПериод</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПутевкаДоговор</name>
    <type>
      <types>DocumentRef.ПутевкаДоговор</types>
    </type>
  </attributes>
  <attributes>
    <name>БезПроверки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>АктМПР</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Заявление</name>
    <type>
      <types>DocumentRef.Заявление</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДобытаяДичь</name>
    <attributes>
      <name>Дичь</name>
      <type>
        <types>CatalogRef.Дичь</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаДобычи</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Охотники_и_рыболовы/src/Catalogs/Охотники/ObjectModule.bsl
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Если НЕ ЧленОООР Тогда
		Индекс = ПроверяемыеРеквизиты.Найти("Охотхозяйство");
		Если НЕ Индекс = Неопределено Тогда
			ПроверяемыеРеквизиты.Удалить(Индекс);
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;	
	
	Если ЧленОООР Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ОхотничьиБилеты.Серия,
			|	ОхотничьиБилеты.Номер,
			|	ОхотничьиБилеты.ДатаВыдачи,
			|	ОхотничьиБилеты.ЗарегистрированВ
			|ИЗ
			|	РегистрСведений.ОхотничьиБилеты КАК ОхотничьиБилеты
			|ГДЕ
			|	ОхотничьиБилеты.Действует
			|	И ОхотничьиБилеты.ВидБилета = ЗНАЧЕНИЕ(Перечисление.ВидыОхотничьихБилетов.ЧленскийБилет)
			|	И ОхотничьиБилеты.Охотник = &Охотник";
		
		Запрос.УстановитьПараметр("Охотник", Ссылка);
		
		Результат = Запрос.Выполнить();
		
		Если Результат.Пустой() Тогда
			Отказ = Истина;
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Охотник является членом охотхозяйства " + Охотхозяйство.Наименование + " и не имеет действительного билета. Запись не возможна.");
			Возврат;
		КонецЕсли;
	КонецЕсли;	

	ОбновитьПовторноИспользуемыеЗначения();
КонецПроцедуры

Процедура ПередУдалением(Отказ)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РазрешениеНаОхоту.Ссылка
		|ИЗ
		|	Документ.РазрешениеНаОхоту КАК РазрешениеНаОхоту
		|ГДЕ
		|	РазрешениеНаОхоту.Охотник = &Охотник
		|	И РазрешениеНаОхоту.Проведен";
	
	Запрос.УстановитьПараметр("Охотник", ЭтотОбъект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		
	Отказ = Истина;
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю("На данного пользователя было выписано разрешение. Удаление не возможно");
	КонецЕсли;

КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	ДанныеОхотника = ОхотаСерверПовтИсп.ПолучитьДанныеОхотника(Ссылка);
	
	Если ДанныеОхотника.ЕстьЧленскийБилет И НЕ Ссылка.ЧленОООР Тогда
		ЧленОООР = Истина;
	ИначеЕсли 	НЕ ДанныеОхотника.ЕстьЧленскийБилет И Ссылка.ЧленОООР Тогда
		ЧленОООР = Ложь;
	КонецЕсли;	
	
		
	Если ЧленОООР = Истина И Ссылка.Охотхозяйство.ЧленствоККОООР = Истина Тогда      
		ЧленККОООР = Истина;
		Иначе
		ЧленККОООР = Ложь;
	КонецЕсли;	
	
		
КонецПроцедуры
